ERP.belugaerp/src/Catalogs/Номенклатура/Номенклатура.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>Номенклатура</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <hierarchical>Checked</hierarchical>
  </extension>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>АлкогольнаяПродукция</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Артикул</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>бг_АнализыДляУдостоверенияОКачестве</name>
    <type>
      <types>CatalogRef.бг_ТиповыеАнализыНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_Вариативность</name>
    <type>
      <types>CatalogRef.бг_ВариативностьНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_ВидОперацииНалогообложенияАкцизом</name>
    <type>
      <types>CatalogRef.бг_ВидыОперацийНалогообложенияАкцизом</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_Влажность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>бг_Выбыл</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>бг_ГодУрожая</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>бг_Добавлен</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>бг_ЕК_СУМ</name>
    <type>
      <types>CatalogRef.бг_ЕК_СУМ</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_КодНоменклатурыSAP</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>18</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>бг_КонтрагентПроизводитель</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_НормативныйДокумент</name>
    <type>
      <types>CatalogRef.бг_НормативныеДокументыСертификацииНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_ОбменB2B</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_ОписаниеСоставаПродукта</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_ОсновноеНаименование</name>
    <type>
      <types>CatalogRef.бг_ОсновныеНаименованияНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_ОсновнойПоставщик</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_Предшественник</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_Проверен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_СрокГодности</name>
    <type>
      <types>CatalogRef.бг_ЕК_Номенклатура_СрокГодности</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_СрокХраненияПробВЛабораторииМесяцев</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>бг_Статус</name>
    <type>
      <types>EnumRef.бг_СтатусыНСИ</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_СтатьяКалькуляции</name>
    <type>
      <types>CatalogRef.СтатьиКалькуляции</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_СтранаПроизводителя</name>
    <type>
      <types>CatalogRef.СтраныМира</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_ТемператураДо</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>бг_ТемператураОт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>бг_ТемператураХранения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>бг_ТипИмпортныхССП</name>
    <type>
      <types>EnumRef.бг_ТипыИмпортныхССП</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_ТипМарки</name>
    <type>
      <types>CatalogRef.бг_КлассификаторТиповМарок</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_УсловияТранспортирования</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>бг_УчетОстатковИРезервовВРазрезеУпаковокПаллет</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_ФайлПиктограммы</name>
    <type>
      <types>CatalogRef.НоменклатураПрисоединенныеФайлы</types>
    </type>
  </attributes>
  <attributes>
    <name>ВесЗнаменатель</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ВесИспользовать</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВестиУчетПоГТД</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВесЧислитель</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ВидАлкогольнойПродукции</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВидНоменклатуры</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ГруппаАналитическогоУчета</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДлинаЗнаменатель</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ДлинаИспользовать</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДлинаЧислитель</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмеренияСрокаГодности</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ИмпортнаяАлкогольнаяПродукция</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ИспользоватьУпаковки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КодТНВЭД</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Крепость</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>5</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>НаборУпаковок</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>1024</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ОбъемДАЛ</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>18</precision>
          <scale>6</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ОбъемЕдиницаИзмерения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ОбъемЗнаменатель</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ОбъемИспользовать</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ОбъемЧислитель</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Производитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПроизводительИмпортерКонтрагент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СрокГодности</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>СтавкаНДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ТипНоменклатуры</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ТоварнаяКатегория</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ЦеноваяГруппа</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections>
    <name>бг_СпособыОбеспеченияПотребности</name>
    <attributes>
      <name>Склад</name>
      <type>
        <types>CatalogRef.Склады</types>
      </type>
    </attributes>
    <attributes>
      <name>СпособОбеспеченияПотребностей</name>
      <type>
        <types>CatalogRef.СпособыОбеспеченияПотребностей</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ERP.belugaerp/src/Catalogs/ВидыНоменклатуры/ВидыНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ВидыНоменклатуры</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>АлкогольнаяПродукция</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>бг_ВариантСинхронизацииWMS</name>
    <type>
      <types>EnumRef.бг_ВариантыСинхронизацииНоменклатурыWMS</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_ВедетсяВERP</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_ВидКлассификатораНСИ</name>
    <type>
      <types>EnumRef.бг_ВидКлассификатораНСИ</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_ВидОперацииНалогообложенияАкцизом</name>
    <type>
      <types>CatalogRef.бг_ВидыОперацийНалогообложенияАкцизом</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_ЕдиницаИзмеренияМест</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_ИспользоватьЗаявлениеОВыдачеФСМ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_ИспользоватьКонечныйНомерДиапазона</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_ИспользоватьНакладнаяНаВыдачуФСМ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_ИспользоватьНачальныйНомерДиапазона</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_ИспользоватьНомерДиапазонаВРулоне</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_ИспользоватьНомерРулона</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_ИспользоватьСериюМарки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_НеФормироватьНаименованиеПоШаблону</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_ОграничиватьДобавлениеИзменениеНоменклатуры</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_УстановитьДействиеОтгрузитьВЗаказеПриЗагрузкеРТиУ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_УчетОстатковИРезервовВРазрезеУпаковокПаллет</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользованиеХарактеристик</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ИспользоватьДатуПроизводстваСерии</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ИспользоватьСерии</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ИспользоватьСрокГодностиСерии</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ОсобенностьУчета</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections>
    <name>ПолитикиУчетаСерий</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>Склад</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ПолитикаУчетаСерий</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ERP.belugaerp/src/CommonModules/бг_ИнтеграцияВГО/Module.bsl
#Область ПрограммныйИнтерфейс

// Формирует в переданном менеджере временных таблиц таблицы ВТНоменклатура и ВТСклады,
//  содеращие данные, необходимые для формирования заказов.
//
//  Параметры:
//   МенеджерВременныхТаблиц - МенеджерВременныхТаблиц - менеджере временных таблиц, 
//                             в которром будут сформированы временные таблицы. 
//   ДополнительныеПараметры - Структура - Дополнительные параметры запроса для формирования таблиц.
//     Ключи: 
//      * Склад              - СправочникСсылка.Склады - ссылка на склад, по которому будет отгрузка по заказу.
//      * ТоварныеКатегории  - Массив - Список товарных категорий, по которым формируются данные в ВТНоменклатура.
//      * Партнер            - СправочникСсылка.Партнеры - ссылка на партнера, которому будет отгрузка по заказу.
//
Процедура СоздатьВспомогательныеВТ(МенеджерВременныхТаблиц, ДополнительныеПараметры) Экспорт
	
	СоздатьВТНоменклатура(МенеджерВременныхТаблиц, ДополнительныеПараметры);
	СоздатьВТСклады(МенеджерВременныхТаблиц, ДополнительныеПараметры);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура СоздатьВТСклады(МенеджерВременныхТаблиц, ДополнительныеПараметры)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Склад", ДополнительныеПараметры.Склад);
	Запрос.УстановитьПараметр("ТоварныеКатегории", ДополнительныеПараметры.ТоварныеКатегории);
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Номенклатура.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ СписокНоменклатуры
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.ТоварнаяКатегория В(&ТоварныеКатегории)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СпрНоменклатура.ВидНоменклатуры КАК ВидНоменклатуры
	|ПОМЕСТИТЬ ВидыНоменклатуры
	|ИЗ
	|	СписокНоменклатуры КАК СписокНоменклатуры
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
	|		ПО СписокНоменклатуры.Ссылка = СпрНоменклатура.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Склады.Ссылка КАК Склад,
	|	ЕСТЬNULL(ВидыНоменклатуры.ВидНоменклатуры, ЗНАЧЕНИЕ(Справочник.ВидыНоменклатуры.ПустаяСсылка)) КАК ВидНоменклатуры,
	|	0 КАК Приоритет,
	|	ИСТИНА КАК ИспользоватьДляОтложенногоОбеспечения
	|ПОМЕСТИТЬ ВТСклады
	|ИЗ
	|	Справочник.Склады КАК Склады
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВидыНоменклатуры КАК ВидыНоменклатуры
	|		ПО (ИСТИНА)
	|ГДЕ
	|	Склады.Ссылка = &Склад
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ СписокНоменклатуры
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВидыНоменклатуры";
	
	Запрос.Выполнить();
	
КонецПроцедуры

Процедура СоздатьВТНоменклатура(МенеджерВременныхТаблиц, ДополнительныеПараметры)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Партнер", ДополнительныеПараметры.Партнер);
	Запрос.УстановитьПараметр("ТоварныеКатегории", ДополнительныеПараметры.ТоварныеКатегории);
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Контрагенты.Партнер КАК Партнер
	|ПОМЕСТИТЬ ВТПартнеры
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|ГДЕ
	|	Контрагенты.Партнер = &Партнер
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Партнер
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СпрНоменклатура.Ссылка КАК Номенклатура,
	|	СпрНоменклатура.ВидНоменклатуры КАК ВидНоменклатуры,
	|	СпрНоменклатура.бг_УчетОстатковИРезервовВРазрезеУпаковокПаллет КАК УчетОстатковИРезервовВРазрезеУпаковокПаллет,
	|	СпрНоменклатура.ЕдиницаИзмерения.Код КАК КодЕИ,
	|	СпрНоменклатура.Код КАК КодНоменклатуры,
	|	ВЫРАЗИТЬ(СпрНоменклатура.НаименованиеПолное КАК СТРОКА(1024)) КАК НаименованиеНоменклатуры,
	|	ВЫРАЗИТЬ(СпрНоменклатура.ТоварнаяКатегория КАК Справочник.ТоварныеКатегории).бг_СкюМТ КАК СКЮ_МТ,
	|	ВЫРАЗИТЬ(СпрНоменклатура.ТоварнаяКатегория КАК Справочник.ТоварныеКатегории).бг_КодНСИ КАК КодДляПоискаНоменклатуры
	|ПОМЕСТИТЬ ВТНоменклатура
	|ИЗ
	|	Справочник.Номенклатура КАК СпрНоменклатура
	|ГДЕ
	|	НЕ СпрНоменклатура.ПометкаУдаления
	|	И СпрНоменклатура.ТоварнаяКатегория В(&ТоварныеКатегории)
	|	И СпрНоменклатура.ТоварнаяКатегория <> ЗНАЧЕНИЕ(Справочник.ТоварныеКатегории.ПустаяСсылка)
	|	И СпрНоменклатура.ТоварнаяКатегория.бг_КодНСИ <> """"
	|	И ВЫБОР
	|			КОГДА СпрНоменклатура.АлкогольнаяПродукция
	|				ТОГДА СпрНоменклатура.ВидАлкогольнойПродукции <> ЗНАЧЕНИЕ(Справочник.ВидыАлкогольнойПродукции.ПустаяСсылка)
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура";
	
	Запрос.Выполнить();
	
КонецПроцедуры

#КонецОбласти
